In [7]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        user="root",
                        password="MySQL"
                        )

sql_cek_databases = "show databases"

databases = pd.read_sql(sql_cek_databases, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(databases)

MySQL Connection is Close

             Database
0       belajar_mysql
1       dqlab_academy
2  information_schema
3               mysql
4  performance_schema
5              sakila
6                 sys
7               world

In [3]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_cek_tables = "show tables"

tables = pd.read_sql(sql_cek_tables, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(tables)

MySQL Connection is Close

  Tables_in_dqlab_academy
0       customer_segments
1             data_retail
2        ms_item_kategori
3           ms_item_warna
4            ms_pelanggan
5              ms_product
6              online_raw
7           payment_fraud
8      retail_raw_reduced
9                students

## Penggabungan Tabel dan Relasi Kolom

In [4]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_cek_tables = "show tables"

tables = pd.read_sql(sql_cek_tables, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(tables)

MySQL Connection is Close

  Tables_in_dqlab_academy
0       customer_segments
1             data_retail
2        ms_item_kategori
3           ms_item_warna
4            ms_pelanggan
5              ms_product
6              online_raw
7           payment_fraud
8      retail_raw_reduced
9                students

In [8]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

df_ms_item_kategori = pd.read_sql(sql_ms_item_kategori, connection)
df_ms_itme_warna = pd.read_sql(sql_ms_item_warna, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(df_ms_item_kategori)
display(df_ms_itme_warna)

MySQL Connection is Close

   nama_item kategori
0      bayam  sayuran
1  belimbing     buah
2       duku     buah
3     durian     buah
4     gandum     buah
5      jamur  sayuran
6  jambu air     buah
7      jeruk     buah

   nama_barang         warna
0         apel         merah
1        bayam         hijau
2  daun bawang         hijau
3         duku  kuning pekat
4       durian        kuning
5       gandum        coklat
6    jambu air         merah
7        jeruk        oranye

In [10]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

sql_code = "select * from ms_item_kategori, ms_item_warna where nama_barang = nama_item"
dataset = pd.read_sql(sql_code, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")
 
display(dataset)

MySQL Connection is Close

   nama_item kategori nama_barang         warna
0      bayam  sayuran       bayam         hijau
1       duku     buah        duku  kuning pekat
2     durian     buah      durian        kuning
3     gandum     buah      gandum        coklat
4  jambu air     buah   jambu air         merah
5      jeruk     buah       jeruk        oranye

In [12]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

ms_item_kategori = "select * from ms_item_kategori"
ms_item_warna = "select * from ms_item_warna"

df_ms_item_kategori = pd.read_sql(ms_item_kategori, connection)
df_ms_item_warna = pd.read_sql(ms_item_warna, connection)

merge_inner_join = pd.merge(df_ms_item_kategori, df_ms_item_warna, how="inner", left_on="nama_item", right_on="nama_barang")

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")
 
display(merge_inner_join)

MySQL Connection is Close

   nama_item kategori nama_barang         warna
0      bayam  sayuran       bayam         hijau
1       duku     buah        duku  kuning pekat
2     durian     buah      durian        kuning
3     gandum     buah      gandum        coklat
4  jambu air     buah   jambu air         merah
5      jeruk     buah       jeruk        oranye